{"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 40, 20], "dtype": "int32", "sparse": false, "name": "input"}, "inbound_nodes": []}, {"name": "reshape_1", "class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [800]}, "inbound_nodes": [[["input", 0, 0, {}]]]}, {"name": "embedding", "class_name": "Embedding", "config": {"name": "embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 25001, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"name": "reshape1", "class_name": "Reshape", "config": {"name": "reshape1", "trainable": true, "target_shape": [1, 40, 6000]}, "inbound_nodes": [[["embedding", 0, 0, {}]]]}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "filters": 20, "kernel_size": [1, 300], "strides": [1, 300], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "filters": 20, "kernel_size": [1, 600], "strides": [1, 300], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape1", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "filters": 20, "kernel_size": [1, 900], "strides": [1, 300], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape1", 0, 0, {}]]]}, {"name": "pooling_1", "class_name": "MaxPooling2D", "config": {"name": "pooling_1", "trainable": true, "pool_size": [1, 20], "padding": "valid", "strides": [1, 20], "data_format": "channels_first"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "pooling_2", "class_name": "MaxPooling2D", "config": {"name": "pooling_2", "trainable": true, "pool_size": [1, 19], "padding": "valid", "strides": [1, 19], "data_format": "channels_first"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "pooling_3", "class_name": "MaxPooling2D", "config": {"name": "pooling_3", "trainable": true, "pool_size": [1, 18], "padding": "valid", "strides": [1, 18], "data_format": "channels_first"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "permuted_1", "class_name": "Permute", "config": {"name": "permuted_1", "trainable": true, "dims": [2, 1, 3]}, "inbound_nodes": [[["pooling_1", 0, 0, {}]]]}, {"name": "permuted_2", "class_name": "Permute", "config": {"name": "permuted_2", "trainable": true, "dims": [2, 1, 3]}, "inbound_nodes": [[["pooling_2", 0, 0, {}]]]}, {"name": "permuted_3", "class_name": "Permute", "config": {"name": "permuted_3", "trainable": true, "dims": [2, 1, 3]}, "inbound_nodes": [[["pooling_3", 0, 0, {}]]]}, {"name": "conv_1", "class_name": "Reshape", "config": {"name": "conv_1", "trainable": true, "target_shape": [40, 20]}, "inbound_nodes": [[["permuted_1", 0, 0, {}]]]}, {"name": "conv_2", "class_name": "Reshape", "config": {"name": "conv_2", "trainable": true, "target_shape": [40, 20]}, "inbound_nodes": [[["permuted_2", 0, 0, {}]]]}, {"name": "conv_3", "class_name": "Reshape", "config": {"name": "conv_3", "trainable": true, "target_shape": [40, 20]}, "inbound_nodes": [[["permuted_3", 0, 0, {}]]]}, {"name": "sentence_vectors", "class_name": "Concatenate", "config": {"name": "sentence_vectors", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv_1", 0, 0, {}], ["conv_2", 0, 0, {}], ["conv_3", 0, 0, {}]]]}, {"name": "sentence_predictions", "class_name": "TimeDistributed", "config": {"name": "sentence_predictions", "trainable": false, "layer": {"class_name": "Dense", "config": {"name": "sentence_prediction", "trainable": false, "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["sentence_vectors", 0, 0, {}]]]}, {"name": "permuted_sent_vectors", "class_name": "Permute", "config": {"name": "permuted_sent_vectors", "trainable": true, "dims": [2, 1]}, "inbound_nodes": [[["sentence_vectors", 0, 0, {}]]]}, {"name": "sentence_weights", "class_name": "TimeDistributed", "config": {"name": "sentence_weights", "trainable": true, "layer": {"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcx4AAAB0AGoBfABkAGQAhQJkAWQChQJmAhkAZANkBI0CUwAp\nBU7pAAAAAOkCAAAA6QEAAAApAdoEYXhpcykC2gFL2gNtYXgpAdoBeKkAcggAAAD6KS9jb250ZW50\nL3JhdGlvbmFsZS1DTk4tMS9yYXRpb25hbGVfQ05OLnB52gg8bGFtYmRhPmUBAADzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": [1], "output_shape_type": "raw", "arguments": {}}}}, "inbound_nodes": [[["sentence_predictions", 0, 0, {}]]]}, {"name": "doc_vector", "class_name": "Dot", "config": {"name": "doc_vector", "trainable": true, "axes": [2, 1], "normalize": false}, "inbound_nodes": [[["permuted_sent_vectors", 0, 0, {}], ["sentence_weights", 0, 0, {}]]]}, {"name": "reshaped_doc", "class_name": "Reshape", "config": {"name": "reshaped_doc", "trainable": true, "target_shape": [60]}, "inbound_nodes": [[["doc_vector", 0, 0, {}]]]}, {"name": "doc_v_dropout", "class_name": "Dropout", "config": {"name": "doc_v_dropout", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["reshaped_doc", 0, 0, {}]]]}, {"name": "doc_prediction", "class_name": "Dense", "config": {"name": "doc_prediction", "trainable": true, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["doc_v_dropout", 0, 0, {}]]]}], "input_layers": [["input", 0, 0]], "output_layers": [["doc_prediction", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}